박조은 강사님 inflearn강의  
단 두장의 문서로 데이터 분석과 시각화 뽀개기 (7강)
출처: https://www.inflearn.com/course/%ED%8C%90%EB%8B%A4%EC%8A%A4-pandas/lecture/20846?tab=note

## 기본 통계 하기 value_counts, nunique,sum,count,mean,median

In [1]:
import pandas as pd
import seaborn as sns
import numpy as np

In [2]:
df = sns.load_dataset('iris')
df.shape

(150, 5)

In [3]:
df.head(2)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

### value_counts() : 각각의 값을 그룹화해서 갯수를 보여줌

종류의 개수를 세는데 적합. categorical한 데이터들의 그룹화된 개수를 세는데 사용

In [4]:
df['species'].value_counts()

virginica     50
versicolor    50
setosa        50
Name: species, dtype: int64

In [5]:
df['petal_width'].value_counts()
# DataFrame으로 묶어서 사용하기도 함.
# pd.DataFrame(df['petal_width'].value_counts())

0.2    29
1.3    13
1.5    12
1.8    12
1.4     8
2.3     8
1.0     7
0.3     7
0.4     7
2.0     6
2.1     6
0.1     5
1.2     5
1.9     5
1.6     4
2.5     3
2.2     3
2.4     3
1.1     3
1.7     2
0.6     1
0.5     1
Name: petal_width, dtype: int64

In [6]:
# 데이터 프레임의 행 세기
len(df)

150

In [7]:
len(df)== df.shape[0]

True

In [8]:
#df.shape
df.shape[0]

150

In [9]:
# 유니크한 값의  개수 확인
df['species'].nunique()

3

In [10]:
df.describe() # 수치형 데이터에 대한 통계적 요약 내용을 보여줌

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [11]:
df.describe(include='all') # exclude 특정타입 제외한 데이터 수치 확인

        sepal_length  sepal_width  petal_length  petal_width    species
count     150.000000   150.000000    150.000000   150.000000        150
unique           NaN          NaN           NaN          NaN          3
top              NaN          NaN           NaN          NaN  virginica
freq             NaN          NaN           NaN          NaN         50
mean        5.843333     3.057333      3.758000     1.199333        NaN
std         0.828066     0.435866      1.765298     0.762238        NaN
min         4.300000     2.000000      1.000000     0.100000        NaN
25%         5.100000     2.800000      1.600000     0.300000        NaN
50%         5.800000     3.000000      4.350000     1.300000        NaN
75%         6.400000     3.300000      5.100000     1.800000        NaN
max         7.900000     4.400000      6.900000     2.500000        NaN

In [13]:
df.describe(include= [np.object]) # exclude 특정타입 제외한 데이터 수치 확인

          species
count         150
unique          3
top     virginica
freq           50

In [14]:
df.describe(include= [np.number])

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

- sum()                Sum values of each object.
- count()                 Count non-NA/null values of  each object.
- median()                Median value of each object.
- quantile([0.25,0.75])   Quantiles of each object.
- apply(function)         Apply function to each object.
- min()                   Minimum value in each object.
- max()                   Maximum value in each object.
- mean()                  Mean value of each object.
- var()                   Variance of each object.
- std()                   Standard deviation of each object.

In [15]:
df['petal_width'].sum()

179.90000000000003

In [16]:
df['petal_width'].count()

150

In [17]:
df['petal_width'].median()

1.3

In [18]:
df['petal_width'].mean()

1.199333333333334

In [20]:
df.quantile([0.25,0.75]) 
df['petal_width'].quantile([0.25,0.75])

0.25    0.3
0.75    1.8
Name: petal_width, dtype: float64

In [23]:
df.min()

sepal_length          7.9
sepal_width           4.4
petal_length          6.9
petal_width           2.5
species         virginica
dtype: object

In [24]:
df.max()

sepal_length          7.9
sepal_width           4.4
petal_length          6.9
petal_width           2.5
species         virginica
dtype: object

In [25]:
df.var()

sepal_length    0.685694
sepal_width     0.189979
petal_length    3.116278
petal_width     0.581006
dtype: float64

In [26]:
df.std()

sepal_length    0.828066
sepal_width     0.435866
petal_length    1.765298
petal_width     0.762238
dtype: float64

### apply(function)

In [32]:
def smp(x):
    #뒤에서 3번째까지의 문자를 가져오는 함수
    x = x[-3:]
    return x

In [31]:
df['species_3']=df['species'].apply(lambda x:x[3]) #익명의 함수 사용
# 아니면 외부에 함수를 만들고 전처리를 해줄 수 있다.

0      o
1      o
2      o
3      o
4      o
      ..
145    g
146    g
147    g
148    g
149    g
Name: species, Length: 150, dtype: object

In [33]:
df['species-3']=df['species'].apply(smp)

In [34]:
df

     sepal_length  sepal_width  petal_length  petal_width    species species-3
0             5.1          3.5           1.4          0.2     setosa       osa
1             4.9          3.0           1.4          0.2     setosa       osa
2             4.7          3.2           1.3          0.2     setosa       osa
3             4.6          3.1           1.5          0.2     setosa       osa
4             5.0          3.6           1.4          0.2     setosa       osa
..            ...          ...           ...          ...        ...       ...
145           6.7          3.0           5.2          2.3  virginica       ica
146           6.3          2.5           5.0          1.9  virginica       ica
147           6.5          3.0           5.2          2.0  virginica       ica
148           6.2          3.4           5.4          2.3  virginica       ica
149           5.9          3.0           5.1          1.8  virginica       ica

[150 rows x 6 columns]

### fillna,dropna로 결측치 다루기

In [38]:
df = pd.DataFrame([[np.nan,2,np.nan,0],[2,4,np.nan,1],
            [np.nan,np.nan,np.nan,5]],
            columns=list('ABCD'))
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  2.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [42]:
df.dropna(axis=1,how='any') 
# axis = 0(행)1(열,컬럼), how = 'all(전부다 null일때 drop)', inplace(바로 반영)

   D
0  0
1  1
2  5

In [44]:
df.dropna(axis=0,how='all')

     A    B   C  D
0  NaN  2.0 NaN  0
1  2.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [45]:
df.fillna(0)

     A    B    C  D
0  0.0  2.0  0.0  0
1  2.0  4.0  0.0  1
2  0.0  0.0  0.0  5

In [53]:
values = {'A': 0, 'B': 1, 'C': 2, 'D': 3}
df.fillna(value=values)

     A    B    C  D
0  0.0  2.0  2.0  0
1  2.0  4.0  2.0  1
2  0.0  1.0  2.0  5

In [54]:
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  2.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [60]:
#df['C'].mean()
df['D'].mean()

2.0

In [52]:
df.fillna(df['D'].mean())

     A    B    C  D
0  2.0  2.0  2.0  0
1  2.0  4.0  2.0  1
2  2.0  2.0  2.0  5

In [69]:
fill_na_value = df['D'].max()
fill_na_value

5

In [70]:
df.fillna(fill_na_value)

     A    B    C  D
0  5.0  2.0  5.0  0
1  2.0  4.0  5.0  1
2  5.0  5.0  5.0  5

In [73]:
#df.isnull()
df.isnull().sum()  #결측치 count

A    2
B    1
C    3
D    0
dtype: int64

In [74]:
df.notnull().sum()  #결측치가 아닌 값 count

A    1
B    2
C    0
D    3
dtype: int64

### Make New Columns
#### assign으로 새로운 컬럼 만들기, qcut으로 binning,bucketing하기